Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K18.tmx
Source language: en_us
Languages: zh_cn

source: The Weir
zh_cn: 拦河坝

source: He pops the catch and lifts the rusty boot.
zh_cn: 伊恩“呯”得一下松开锁扣，把锈蚀斑斑的后备箱门推向上。

source: Quivering with excitement, the dogs burst from the back of the car, squirm under the lowest bar of the fence, and bolt across the field in great arcing bounds.
zh_cn: 见此光景，他的狗激动得摇头摆尾，登时从车后面窜了出来，先是跑到篱笆幛最低的栅栏下扭动着身子，随后就在田野里沿弧形大圈狂奔起来。

source: Leo and Fran, big chocolate-and-white pointers.
zh_cn: 那是他的雷欧和佛兰，两只大型巧克力色夹白色的猎犬。

source: He drops the chewed and ragged tennis ball into one jacket pocket, the coiled leather leads into the other, grabs the old gripless tennis racket, and slams the boot.
zh_cn: 伊恩把那只被咬得豁七豁八的棒球放进一边的夹克衫口袋里，往另一边的口袋装上绕好的皮狗绳，抓起那只旧网球拍子（拍子手柄并没有绑带），呯的一下关上了门。

source: He beeps the lock and climbs the stile.
zh_cn: 他按了下锁车键，开始往梯磴上爬。

source: Grass stretches into the distance.
zh_cn: 草场一直绵延到远方。

source: Twenty acres. There are no sheep this year, so half a million buttercups hover just above the ground.
zh_cn: 有二十英亩的样子，今年这里没有羊，所以有大约五十万株的毛茛还留在了地面上。

source: He can smell the May blossom, the same chemicals that are in semen and corpses, so he read the other day.
zh_cn: 空气中阵阵传来山楂花盛开的味道，这花里的化学物质—--这是有天他读到的---原来和精液，尸体里所含的东西是一样的。

source: Wytham Woods rise beyond the meadow to his left.
zh_cn: 往左看，牧场那边是威萨姆森林。

source: Up there among the trees is the path called the Singing Way, where pilgrims broke into song as they passed My Lady’s Seat and looked across the silver flood of Port Meadow to the inns and spires of Oxford.
zh_cn: 林间有条叫“Singing Way”的小路，每次朝圣者们从“My Lady’s Seat”这里走过就会唱歌，波特草场的河边，银色波光潋滟，从这里会看到牛津大学那里的宿舍和尖塔。

source: It’s one of those spring days which seem warm and cold at the same time. Cirrus clouds overhead. Ice crystals at sixteen thousand feet.
zh_cn: 这样的春日，乍暖还寒，头上是卷云，一万六千英尺的高空则是冰晶。

source: Enough blue to make a pair of sailor’s trousers.
zh_cn: 天空蓝的不多不少，够做条海军蓝的裤子的。

source: A pied wagtail lands briefly on the path in front of him, then hops back into the air and is carried away.
zh_cn: 一只鸰落在了他前面的小路上，随即又飞回到空中，一时不知所踪。

source: Leo races toward him and skids to a halt with Fran in pursuit.
zh_cn: 雷欧朝他狂奔而来，快到面前则打滑停下，后面跟的是佛兰。

source: He barks and half prostrates himself, forelegs flat on the ground, hindquarters in the air.
zh_cn: 雷欧叫着，半趴在地上，前面两腿贴在地面，后两条则翘到了空中。

source: Throw the ball throw the ball throw the ball.
zh_cn: 甩球，甩球，甩吧。

source: Ian lobs it into the air, whacks it hard, and both dogs launch themselves backward, twisting in midair so that they land on all fours, then run like racehorses in old paintings, the ball still up there, sliding around that big curve.
zh_cn: 伊恩把球抛到空中，用球拍大力挥了出去，两只狗先是向后发力，随后在半空中扭动着身躯，这样好四肢同时着地，之后便象旧油画里的赛马一样奔了起来，这时的球仍在空中，沿一条巨大的弧形向下坠落。

source: To his right, the river is full from last week’s downpour, the surface purling midstream as the water sorts itself out below the weir.
zh_cn: 伊恩右边的河，因为上周的大雨此时已涨满，因为这里建有拦河坝的缘故，河水到坝下不得不分开，再合拢，所以河中央可看到因水下分流在水面上形成的漩涡。

source: A buzzard circles above the scrubby wasteland on the far side.
zh_cn: 远处满是灌木丛的荒地上，有一只秃鹫在打转。

source: He treads carefully over the loose twisty poles of the cattle grid and feels, as he always does at this precise point, that he has crossed an invisible boundary that marks the limit of the town’s reach.
zh_cn: 脚下是拦牛栅栏，松松垮垮，洞眼又弯弯扭扭，伊恩小心翼翼地走在上面，每到这样的节骨眼上就觉得自己是踩在小镇那看不见的边界线似的。

source: It’s now seven weeks since Maria left, and he’s rather pleased at how well he’s coping.
zh_cn: 玛利亚离开已经有七周了，自己应付得还不错，这倒是挺让他满意的。

source: The dogs help, dragging him out on long walks like this.
zh_cn: 狗帮了忙，它们会象这样拽着他到外面来长时间的走走。

source: Having the time of their lives, probably.
zh_cn: 兴许这就是他们最好的时光了。

source: Plus, thanks to them, the house is never empty.
zh_cn: 也是要多亏了这两只狗，有了它们家里才永远不显得空荡。

source: He’s learning to cook for himself after twenty-six years: macaroni and cheese, shepherd’s pie. . . .
zh_cn: 时隔26年，他又在学着自己煮饭吃了：通心粉，奶酪，牧羊人派等等。

source: And reading his way through the stacks of books that have been glaring at him from the shelf above the TV for the last God knows how long: John Grisham, Philip Pullman, the one set in Afghanistan whose author he can never remember.
zh_cn: 书架上成堆的书放在那里，不知放了多长时间，一直在瞪眼看他，那里有约翰·格雷森姆，有菲利普·普尔曼,还有个写发生在阿富汗，作者叫个什么他怎么也记不住的书，现在他伊恩都拿出来读了。

source: Fran returns with the ball in her mouth.
zh_cn: 佛兰嘴里叼着球回来了。

source: They do a little dance of dodge-and-feint.
zh_cn: 两只狗你跳我蹦，玩起了你佯攻我躲闪的游戏。

source: She drops it.
zh_cn: 佛兰把球扔下。

source: He picks it up and whacks it away again.
zh_cn: 伊恩拿起来，再次把它击了出去。

source: If there are rough patches, that’s to be expected.
zh_cn: 如果说生活里会有什么困苦，那都可以想象得到。

source: Change gets harder as you get older, just as the body becomes less flexible.
zh_cn: 就象人的身体会变得不太灵活一样，一个人变老了，要说变化也不会有太大。

source: Today, for example.
zh_cn: 你比方说今天。

source: The nagging feeling he has that his marriage is only the latest thing to have slipped away.
zh_cn: 要有什么烦心事，那最近的就只有自己的婚姻已悄然不再了这件事。

source: The world is shifting too fast, in ways he doesn’t understand, and values he grew up with have become vaguely comic: courtesy, respect, stoicism, reticence.
zh_cn: 这世界变化得太快，他真是不明白，那些自己从小到大都秉持的价值观：做人要有礼节，有懂得尊重别人，克已坚忍，矜持克制，现在不知怎么成了搞笑。

source: When did holding a door open for a woman become an insult? Teen-agers watching pornography on their phones.
zh_cn: 什么时候为女士开个门成了是在侮辱她了？年青人就着手机就可以看色情的东西。

source: He wonders if it all comes down to Timothy, the friction that ended the marriage.
zh_cn: 他在想是不是蒂莫西是根本的原因，是因为他起的摩擦导致了婚姻的结束。

source: Or whether, when you have a ready-made answer like that, you use it lazily for every question.
zh_cn: 抑或是你已经有了个预设的答案，只要一出问题蒂莫西就成了万能挡箭牌。

source: The fact that their son’s behavior may be malicious is what makes it hardest to handle, Timothy wanting them to suffer.
zh_cn: 可能蒂莫西就是要肆意妄为，这是最难接受的现实，儿子就是成心要他们俩个不好过。

source: Three years without a postcard, an e-mail, a phone call.
zh_cn: 三年了，一张明信片不寄，一封邮件不写，一个电话也不打。

source: How angry he felt when Maria said that it would be better if Timothy were dead.
zh_cn: 玛利亚说蒂莫西死了才好呢，你不知道这话伊恩听了心里有多愤怒。

source: Her own child.
zh_cn: 这可是她的亲骨肉呀。

source: He has dreams of a blurred postmark.
zh_cn: 伊恩老是在梦里梦到一张面目不清的明信片。

source: Lhasa? Marrakesh? Stepping off the plane into sauna shimmer.
zh_cn: 地点是拉萨？是马拉喀什？在一片雾气的霞光笼罩之下，走下飞机。

source: Hostels, cafés, some unshaven local policeman with his feet on the desk under an idle ceiling fan.
zh_cn: 旅馆，咖啡馆，某个胡子邋遢的地方警察，脚翘在桌子上，头上是一只闲置的吊扇。

source: The photograph in his pocket getting more dog-eared and faded by the day.
zh_cn: 袋子里的那张照片越发地卷了毛边，日久天长色都褪了。

source: Fran returns yet again with the tennis ball. Leo is busy chasing something.
zh_cn: 佛兰又带着那只网球回来了，雷欧正忙着在追什么东西。

source: So long as he doesn’t bring it back bloody and struggling.
zh_cn: 只要它不弄个什么还在动的，血淋淋的东西回来就成，别的留它去吧。

source: Ian hits the ball high into the air with a satisfying boink of the taut strings.
zh_cn: 伊恩把球击向高空，球撞击在绷得紧紧的球拍线上，发出了一声让人爽快的“呯嘤”声。

source: She isn’t with someone else, thank God.
zh_cn: 她不会是和什么人搞上了，谢天谢地。

source: Unless she’s hiding it.
zh_cn: 除非是她刻意隐瞒。

source: Which wouldn’t be hard, him being blind to so many things.
zh_cn: 要隐瞒也不是难事，伊恩这个人对很多事都眼盲。

source: There is movement at the edge of his field of vision now.
zh_cn: 这时伊恩目光所能及的田野边上有什么东西在动。

source: Someone is walking along the gantry of the weir that runs between the farmland and the island.
zh_cn: 农田和小岛之间有个拦河坝，有人正沿着坝的龙门架在走。

source: The lockkeeper, presumably, or an inspector from the Environment Agency.
zh_cn: 大概是看守水闸的人，要不是环保部门的检测人员。

source: But then the person turns, and he sees a bright-red rucksack.
zh_cn: 可这个时候走的那个人转了过来，伊恩看到了一只亮红色的帆布包。

source: It’s a woman.
zh_cn: 是个女人。

source: She must have lost her way.
zh_cn: 她这是迷路了。

source: As far as he knows, you can reach the weir only via an unmarked track that descends from the hard shoulder of the ring road.
zh_cn: 就他所知，从环形路的硬质路肩上向下有条道，在地图上是没有标识的，只有从那儿下来才会到拦河坝这儿。

source: Black leggings, denim skirt, big tartan shirt, long straight blond hair.
zh_cn: 黑色的底袜，牛仔裙，宽松的格子衬衫，又长又直的金发。

source: Twenty, maybe twenty-five.
zh_cn: 有20，25的样子吧。

source: She seems unsure of her footing and is supporting herself by holding onto the metal uprights and the rusted valves.
zh_cn: 她每走一步都非常小心，抓着坝上的金属立杆，生了锈的阀门，以免摔倒。

source: It is not a good place to be unsteady on your feet.
zh_cn: 选这种地方来试自己走得稳不稳，选错地儿了。

source: Again Fran blocks the path in front of him, tail up, head down, panting, tennis ball between her paws.
zh_cn: 佛兰又蹦到了他的面前，挡着他的道，尾巴撅朝天，头低着，气喘吁吁，爪子间是那只网球。

source: Not now.
zh_cn: 等会儿。

source: She whimpers. Please please.
zh_cn: 佛兰呜呜咽咽，象是在说“扔吧，扔吧主人。”

source: He picks it up, wallops it away, and starts walking upriver toward the lock.
zh_cn: 伊恩把球捡起来，使劲击了出去，开始朝河的上游往闸口那儿走去。

source: Beneath the woman’s feet, the whole river is being forced through a single open gate, a fat silver spout curving into the churn of surf.
zh_cn: 女孩子的脚下设了个单开的门，整条河到了这里别无出口，只得从此门中过，河流被挤成了一条粗壮了银色水柱，如同翻滚的冲浪波，成弧形向前。

source: The roar could be a house on fire.
zh_cn: 水声轰鸣如同一座着火的房子。

source: She comes to a halt at the very center of the weir.
zh_cn: 那姑娘到了拦河坝的正中央停住了。

source: She is clearly in some kind of trouble.
zh_cn: 很明显她这是有麻烦了。

source: Sudden dizziness, maybe, or that phobia people get on bridges.
zh_cn: 可能是突然头发晕，也可能是人到了桥上总会有的那种恐惧。

source: He can imagine standing there and looking down and being spooked by that torrent.
zh_cn: 伊恩可以想象人站在这种地方，向下看，是会被这种急流给噤住了。

source: He wants to call out to her, reassure her that he will be with her in a few minutes, but there is no way she will hear him at this distance and over that noise.
zh_cn: 他想大声叫她一下，告诉她不要怕，几分钟之内自己就可以到她那儿，可离得这么远，水声又这么吵，她怎么可能会听得见。

source: He starts to run.
zh_cn: 伊恩开始跑。

source: If he remembers correctly, there is only a chain to keep pedestrians from crossing the lock.
zh_cn: 如果记得没错的话，为不让行人跨过闸口，这里就只设了一条链子。

source: Presumably there is some kind of path through the trees.
zh_cn: 大概有条什么穿过树林的小路可以到那儿的。

source: It will take him, what, two or three minutes?
zh_cn: 这怕是要花上两分钟，还是三分钟？

source: Then he sees her let go of the supports.
zh_cn: 这时伊恩看到那个女人松开了自己的抓手。

source: She is facing downriver and he realizes that she is planning to jump.
zh_cn: 她脸朝河下，伊恩意识到她这是要跳河。

source: Understands, too, why she was staggering, because why else would you wear a rucksack if you were planning to do something like that? He feels sick at the thought.
zh_cn: 同一时间伊恩也明白了为什么她走起路来会踉踉跄跄的，因为你说她要不是想自杀，她背这个背包还能做什么？一想到这个，伊恩很是难过。

source: “No!” He waves his arms, but she does not turn her head.
zh_cn: “不要，”伊恩对着她挥手，但姑娘并没有回头。

source: She pitches gently forward.
zh_cn: 她慢慢地向前倾。

source: It is both more and less real than anything he has ever seen.
zh_cn: 这样的场景见过没？好象没有，又好象见过。

source: Time really does slow down.
zh_cn: 时间确实是慢下来了。

source: Her blond hair rises like a candle flame.
zh_cn: 那女人金色的头发就象烛火似的立了起来。

source: She seems completely relaxed, more like someone sleeping than like someone falling.
zh_cn: 她似乎完全放松，那样子不象是要跳河的，倒更象是睡着了。

source: She vanishes into the foam.
zh_cn: 一下子她就消失在泛白沫的河流里。

source: Everything is suddenly back to normal.
zh_cn: 瞬间一切都恢复了正常。

source: The dandelions, the clouds, the buzzard.
zh_cn: 蒲公英，云朵，秃鹫都还在。

source: For a few seconds he wonders if he really saw it.
zh_cn: 有这么几秒的功夫伊恩在想刚才是不是真有人跳下去了。

source: But Leo is standing on the bank beside him, barking at the water, and he understands that the woman is dying right now, somewhere out there, trapped in the stopper, perhaps, being tumbled and battered in that big drum of water.
zh_cn: 但身旁的雷欧站在河岸上，正对着河水叫，伊恩意识到了这个女人正命悬一线，就在河里的什么地方，被阀门给牵住了，可能正被汹涌的水流撞来撞去，翻滚跌爬。

source: He takes his phone out of his trouser pocket but his hands are trembling too much to dial a number.
zh_cn: 伊恩从裤袋里拿出了电话，可手啰嗦得一个号码也拨不出去。

source: Then he sees it in the water, the briefest flash of red.
zh_cn: 这时他看到水里有个什么红色的东西很快地闪了一下。

source: His jacket and his shoes are off.
zh_cn: 转眼间伊恩脱下了自己的夹克，鞋子。

source: He does not remember doing this.
zh_cn: 怎么脱的自己都记不清了。

source: Red again midstream.
zh_cn: 河中间那个红色又显了一下。

source: Both dogs at the bank now, barking.
zh_cn: 这时两只狗都跑到了河边大叫。

source: He jumps into the shallows.
zh_cn: 伊恩跳进了浅水处。

source: This is a stupid thing to do.
zh_cn: 这么做真是蠢。

source: Weed and sucking mud.
zh_cn: 这边全是水草，还有淤泥。

source: He throws himself forward in a clumsy half dive.
zh_cn: 伊恩腾不出手，挪不开脚，半潜水向前游着。

source: The silty bottom reluctantly lets him go.
zh_cn: 河底都是淤泥，牵缠着他，无法前行。

source: The water is so cold his chest seizes and he cannot breathe.
zh_cn: 河水很凉，冰得他的胸一阵阵发麻，气都接不过来。

source: He gathers his energy and shouts the way he would shout if he were lifting a heavy weight.
zh_cn: 伊恩集聚起全身的力气，就象在举个重物一样，一边划，嘴里一边喊着。

source: His ribs loosen.
zh_cn: 他的肋骨渐渐地没有那么绷紧了。

source: It is nothing like the sea; it is nothing like a pool.
zh_cn: 这河一点不象海，一点不象水池。

source: The water sweeps him sideways.
zh_cn: 水流不断把伊恩往边上推。

source: He can no longer touch the bottom with his feet.
zh_cn: 他的脚已经触不到底。

source: He realizes how big the river is now that he is inside it, how strong, how lost the woman must be, and how slim his chances are of finding her.
zh_cn: 到了河里他才知道河有多宽，水流有多急，那个女人一定不知道给冲到哪里去了，自己要找到她成数有多小。

source: He ducks under the surface, but the water is the cloudy green of Victorian bottle glass and he can see for a couple of feet at most.
zh_cn: 伊恩潜下水面，可河里的水就象维多利亚时代的瓶玻璃似的，一片雾蒙蒙的绿色，最多也只能看到几英尺的样子。

source: He lifts his head out of the water and sees how swiftly he is being carried downriver.
zh_cn: 头抬出水面，伊恩看到自己这么快的时间里就被水冲着顺流而下。

source: The banks are hidden now behind half-submerged bushes and trapped flotsam, the flow narrowing and picking up speed to squeeze under the bridge.
zh_cn: 这时的河岸已经被半在水下的灌木丛和没冲走的废弃物给挡住了，水流开始变窄，速度加快，一拥而到桥下。

source: Below the bridge is the weir stream for the next lock.
zh_cn: 桥下是积蓄给下一个闸口的坝口水流。

source: He is suddenly very alone and very frightened, an idiot who has jumped into a swollen river.
zh_cn: 突然间伊恩意识到了自己就一个人，跳进这么湍急的河流里，感到很是后怕，真是猪脑子呀你。

source: His sodden clothes are shockingly heavy, and it is becoming increasingly hard to keep his head above water.
zh_cn: 衣服全湿了，穿在身上感觉非常的沉，要维持头在水面之上，越来越难了。

source: She looms out of the bubbling green and claws at his face.
zh_cn: 那女人从翻滚的水流里冒了出来，上来抓他的脸。

source: Mostly he is angry that she has attacked him when he is risking his life to save her.
zh_cn: 自己豁出命来救她，居然还来打我，通常情况下伊恩会生气的。

source: Memories of lifesaving classes at school, Mr. Schiller with his speech impediment, pajama bottoms knotted at the ankles.
zh_cn: 可这会儿顾不得了，脑子里回想起学校学得救生课，那个说话有障碍的希勒先生是怎么说的来着？睡裤脚底这儿打个结。

source: He yanks her around so she’s facing away from him. Cup a hand under the chin, that was it. Her arms and legs are pedalling hard, trying to make a ladder of the water.
zh_cn: 伊恩把姑娘猛得拉转过身，让她的脸背着自己，自己一只手拢在她下巴上，就是这样。姑娘的手脚都在拼命的乱踹乱蹬，象蹬梯一样在拼命踩水。

source: Silver bubbles pour from her nose and mouth.
zh_cn: 她的嘴里，鼻子里不住地冒出银色的水泡。

source: He can’t keep her mouth above the surface.
zh_cn: 伊恩没有办法把这个姑娘的嘴保持在水面之上。

source: The rucksack. Christ. He’d forgotten.
zh_cn: 要了命，这个背包。怎么把这个给忘了呢。

source: He doesn’t have the strength but the idea of not doing it is unbearable.
zh_cn: 是要解下来，可伊恩实在没力气，不解，自己又觉得不成。

source: He gulps as much air as he can, then ducks under.
zh_cn: 伊恩拼命吸进尽可能多的空气，随即钻入水里。

source: They sink together, the big red ballast pulling them down.
zh_cn: 俩个人一起往下沉，那个红色的背包又大又重，拖着俩个人往下沉。

source: He turns her around and grabs at the belt. Which sort of buckle is it?
zh_cn: 伊恩把女孩转过身，拖住背包的带子，这是种什么搭扣？

source: Sudden darkness overhead. The bridge. They’re moving fast. He needs a knife. He doesn’t have a knife.
zh_cn: 突然间眼前一阵黑，是到了桥下面，水把俩人急速向前推，这个时候伊恩要把刀，可他手头没有。

source: Yank, squeeze, twist.
zh_cn: 拉拉看，压压看，再拧拧看。

source: She is punching him and grabbing his hair but whether she is trying to get to the surface or keep him from undoing the rucksack he cannot tell.
zh_cn: 女孩子用手捶他，揪他的头发，这样做是想要到水面上去，还是阻止自己不让动她的包，伊恩也搞不清。

source: His lungs are crying out for air. Don’t breathe. A vicious scrabbling panic.
zh_cn: 自己的肺太需要吸进空气，别呼吸。一阵心慌，双手，双脚没命似的乱舞乱蹬起来。

source: His thoughts are becoming blurred, his brain starting to shut down.
zh_cn: 伊恩的意识渐渐有些模糊，脑子也开始不听指挥。

source: Some fierce animal hunger for life wipes the woman from his mind.
zh_cn: 求生的本能这样的强，不管了，顾不得这个姑娘了。

source: He kicks upward—hang on, hang on—and bursts into sunlight.
zh_cn: 伊恩向上踩水---坚持住，坚持住----看到了，看到太阳光了。

source: He heaves down a lungful of air and dirty water, chokes and coughs it out, then sucks down another lungful. Then a third.
zh_cn: 他把满肺里憋得气，还有呛进的脏水都吐了出来，一阵呛着伊恩咳嗽起来，随即吸进了一口空气，再接着第三口。

source: She is down there somewhere, dying, dead.
zh_cn: 那个姑娘在水下什么地方，要死了，可能已经死了。

source: He can hear the dogs barking nearby.
zh_cn: 伊恩听得到自己的狗在附近叫着。

source: She surfaces suddenly beside him, head above the water now.
zh_cn: 突然间姑娘从他旁边冒了出来，头到了水面上。

source: No rucksack.
zh_cn: 背包没有了。

source: He must have got it off. Her eyes are closed. She’s not moving.
zh_cn: 肯定是伊恩把包给解掉了，她的眼睛闭着，人一动不动。

source: He grabs her hair this time.
zh_cn: 这次轮到伊恩抓住了她的头发。

source: No time for niceties.
zh_cn: 顾不得考虑这么多了。

source: She doesn’t respond. Maybe he is dragging a corpse.
zh_cn: 女孩子没有反应，可能她已经死了，伊恩拖得是具死尸。

source: He swims with one arm, breaststroke legs.
zh_cn: 伊恩一手拖着她，腾出另一只手出来划水，脚是蛙泳的姿势。

source: Way past the bridge now.
zh_cn: 早过了桥很远了。

source: A hundred metres until the weir stream peels off and drags them sideways.
zh_cn: 俩人就这样游着有一百来米，直至拦河坝下的水分开，把他们俩人往边上推。

source: He swims hard in the other direction, grabbing the end of a thorny branch. It snaps. He grabs another and it holds.
zh_cn: 伊恩拼命向另一个方向游，抓住了一根带刺树枝的末端。树枝断了，伊恩又抓住另一根，这支没断。

source: They swing toward the bank and slow down as they are pulled out of the main current.
zh_cn: 俩人朝着河岸游去，离开主水流后速度慢了下来。

source: The bottom. He can feel it, thank God. Sludge and roots.
zh_cn: 脚踩到底了，伊恩能踩到底了，谢天谢地。河底有淤泥，有根。

source: He heaves her shoulders upright so she’s sitting in the shallow water.
zh_cn: 伊恩顶着女孩的肩向上，这样她好坐在浅水里。

source: A reedy foot of bank between two brambles.
zh_cn: 这是一块长满河草的河床，两边全是荆棘。
